In [1]:
import pandas as pd
import numpy as np

In [2]:
url = "/Users/karollvivianalopezvillegas/GitHub/OKVET_DA_Final_project/02_Datasets_pre_cleaning/TuFórmula_Pacientes.xlsx"

In [3]:
df = pd.read_excel(url)

In [4]:
df.shape

(140, 2)

In [5]:
df.head() # ACCIONES: Separar nombre del paciente del apellido del cliente

           PACIENTE            CLIENTE
0  Rapunzel Acevedo    Adriana Acevedo
1       René Pineda     Adriana Pineda
2      Mogo Sánchez  Ana María Sánchez
3      Asia Sánchez  Ana María Sánchez
4     Biggie Tamayo  Juan Pablo Tamayo

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   PACIENTE  140 non-null    object
 1   CLIENTE   140 non-null    object
dtypes: object(2)
memory usage: 2.3+ KB

In [7]:
df.isna().sum()

PACIENTE    0
CLIENTE     0
dtype: int64

In [8]:
df.nunique()

PACIENTE    140
CLIENTE     103
dtype: int64

In [9]:
df[["PACIENTE" , "APELLIDO PACIENTE"]] = df["PACIENTE"].str.split(" ", n = 1, expand = True)

In [10]:
df

     PACIENTE            CLIENTE APELLIDO PACIENTE
0    Rapunzel    Adriana Acevedo           Acevedo
1        René     Adriana Pineda            Pineda
2        Mogo  Ana María Sánchez           Sánchez
3        Asia  Ana María Sánchez           Sánchez
4      Biggie  Juan Pablo Tamayo            Tamayo
..        ...                ...               ...
135    Cronos                 NN              None
136    Manada                 NN            Suarez
137    Manada     Viviana Herrea           Herrera
138      Lucy    Camila Hincapie          Hincapie
139    Morita  Sara Friedrichsen      Friedrichsen

[140 rows x 3 columns]

In [11]:
df.drop(columns = "APELLIDO PACIENTE", inplace = True)

In [12]:
df.head()

   PACIENTE            CLIENTE
0  Rapunzel    Adriana Acevedo
1      René     Adriana Pineda
2      Mogo  Ana María Sánchez
3      Asia  Ana María Sánchez
4    Biggie  Juan Pablo Tamayo

In [13]:
# df.to_excel("/Users/karollvivianalopezvillegas/GitHub/OKVET_DA_Final_project/04_Datasets_final/df_TuFórmula_Pacientes.xlsx", index = False)